from aiogram import Router, F, types
from aiogram.fsm.context import FSMContext
from aiogram.utils.keyboard import ReplyKeyboardBuilder

from keyboards.reply import start_reply_button, self_care_reply_button
from keyboards.inline import self_care_video

rt = Router()

@rt.message(F.text == "Забота о себе")
async def emotional_masha(message: types.Message):
    await message.answer(text="Выбери то, что ты чувствуешь на данный момент", reply_markup=await self_care_reply_button())


@rt.message(F.text == "Тревожность и стресс")
async def emotional_masha(message: types.Message):
    photo = types.FSInputFile("img/breath.png")
    await message.answer_photo(photo=photo, caption="Дыхание: Положи одну руку на живот, а другую на грудь\n сделай вдох на 4 счета, задержка на 7, выдох на 8. Повтори 5 раз", reply_markup=await self_care_video())


@rt.message(F.text == "Низкая самооценка")
async def emotional_masha(message: types.Message):
    await message.answer(text="""Произнеси эти слова про себя или вслух:
1. Я верю в свои силы и с каждым днем они только укрепляются.
2. Мне нравится быть собой, и я принимаю себя такой, какая я есть.
3. Я не осуждаю себя за ошибки и учусь на них.
4. Я сильная, добрая и умная.
5. Я могу добиваться всего, чего захочу. 
""", reply_markup=await start_reply_button())


@rt.message(F.text == "Проблема со сном")
async def emotional_masha(message: types.Message):
    await message.answer(text=""" 1. Дыхание 4-7-8 для сна: Вдох 4с → пауза 7с → выдох 8с. Повторяй до засыпания 😴,
2. Техника 'Армия США': Расслабь лицо → опусти плечи → руки вдоль тела → ноги расставь → очисти мысли за 10 сек 💂",
3. Визуализация спуска: Представь что медленно спускаешься по лестнице, считая ступеньки 🔽",
4. Вечерний ритуал: За час до сна: теплый душ, чай, книга, выключение гаджетов 🛁"
""", reply_markup=await start_reply_button())


@rt.message(F.text == "Концентрация в работе")
async def emotional_masha(message: types.Message):
    await message.answer(text="""    1. Метод Помидора: 25 минут работы → 5 минут отдыха. После 4 циклов - длинный перерыв 🍅,
2. Правило 2-х минут: Если дело занимает меньше 2 минут - сделай его сразу ⏱️,
3. Разделение слона: Разбей большую задачу на маленькие шаги по 15-20 минут 🐘,
4. Стартовый ритуал: Создай простой ритуал перед началом работы (чай, музыка, глубокий вдох) 🎵
""", reply_markup=await start_reply_button())


@rt.message(F.text == "Эмоциональные качели")
async def emotional_masha(message: types.Message):
    await message.answer(text="""1. Шкала эмоций: Оцени эмоцию от 1 до 10. Что может снизить оценку на 1-2 балла? 📊,
2. Техника 'СТОП': Стоп - остановись, Три вдоха - подыши, Обзор - что происходит, Продолжай - действуй осознанно 🛑,
3. Эмоциональный прогноз: Как изменится эта эмоция через час/день/неделю? ⏳,
4. Физический выход: Попрыгай, потанцуй, пробегись - выпусти эмоции через тело 💃
""", reply_markup=await start_reply_button())



@rt.callback_query(F.data.startswith("turn_on_timer"))
async def handler_self_care_timer(callback: types.CallbackQuery):
    video = types.FSInputFile("video/timer.mp4")

    await callback.message.answer_video(
        video=video,
        caption="Таймер запущен!",
        reply_markup=await start_reply_button()
    )

    await callback.answer()